L = {}

L["pro.diver"] = "Cтреляйте под водой"
L["pro.quickdraw"] = "Быстрее вытаскивайте/убирайте в кобуру"
L["pro.last"] = "Урон от последнего выстрела"
L["pro.ace"] = "Шанс нанести критический удар по NPC"
L["pro.magcap"] = "Увеличенная емкость магазина"
L["pro.refund"] = "Зарядите патрон в магазин при выстреле в голову"
L["pro.runandgun"] = "Стреляйте во время бега"
L["pro.headshotdamage"] = "Тройной урон от выстрела в голову"
L["pro.slowenemies"] = "Замедляет врагов при попадании"
L["pro.invistracers"] = "Невидимые трассеры"
L["pro.fullauto"] = "Автоматический"

L["con.magcap"] = "Уменьшенная емкость магазина"
L["con.beam"] = "Видимый лазерный луч"
L["con.light"] = "Видимый луч фонарика"
L["con.noscope"] = "Нет точки прицеливания"

L["pro.ammo_blank"] = "Безвредный!"
L["con.ammo_blank"] = "Безвредный."

L["pro.ignite"] = "Поджигает цели"